{
  "Job": [{
    "title": "Research Assistant",
    "organization": "Academia Sinica",
    "period": ["06/25/2021", ""],
    "icon": "AcademiaSinica.svg",
    "tag": "Machine Learning",
    "content": {
      "description": "test",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  },{
    "title": "Co-founder/Full-stack Engineer",
    "by": "CityChaser Co.",
    "period": ["11/01/2019", ""],
    "icon": "CityChaser.png",
    "type": "Entrepreneurship",
    "content": {
      "description": "<p><strong><span>CityChaser</span></strong><span>, from a project in a class, to two main organizers only, and now students from three different universities (NTU, NCKU, and NCCU) working together, focusing on the network technology and cloud applications. We are now grouped from different departments, including Computer Science, Industrial Engineering and Management, Industrial Design, Business Management, and so on. There are a total of 16 people counting on many aspects of our product development, from user interface design to software development. We adopt various tools to improve our productivity during the global pandemic and WFH, including Jira (for agile project development), Slack (a proprietary business communication platform), stand-up meetings, planning poker, etc.&nbsp;</span></p><p><span>Our first product, <strong>Kyronus</strong>, is&nbsp;</span><span>a cross-platform GPS-enabling mobile game championing Taiwan&#39;s culture of historical site. Players acted as interstellar pioneers to launch their rocket to the location and collect the resource. As a planet governor, players also build their buildings, manage the citizen, and do agriculture to obtain proper food for people living on the planet.</span></p><p><span>What I have learned from this experience:</span></p><ol><li><span>The concept of agile project management.</span></li><li><span>The concept of entrepreneurship and start-up, including business model, balance sheet statement, cash flow statement, team management, etc.</span></li><li><span>The practice of Apache Cordova plugin.</span></li><li><span>The practice of DevOps pipeline for mobile app development.</span></li><li><span>The practice to design, launch, and run a new business.</span></li></ol>",
      "contributions": ["Developed several kernel systems, including mining, collecting, human resource system", "Introduced DevOps pipelines using <b>GitLab CI/CD</b> and <b>Docker</b> for automatic deployment and thus successfully shortened the development cycle from hours to minutes.", "Acted as a <b>Scrum Master</b> to guide a 7-person team to schedule and manage sprints and backlogs with planning poker, Kanban board, and stand-up meeting.", "Reduced the Docker image's size for CI/CD by up to <b>300%</b> with Multi-Stage Builds tech to accelerate the build and deployment processes."],
      "awards/honors": ["Won <b>3rd prize<b> out of 24 teams in Mobile Game Development Track of <b>Vision Get Wild Award 2020</b>", "Shortlisted in first stage of <b>U-Start Innovation and Entrepreneurship Program 2020</b> by Youth Development Administration, Ministry of Education and thus obtained $18,000 USD (approx.) funding", "Crowdfunded $3,500 USD (approx.) from 100+ sponsors."],
      "images": ["experiences/CoFounder_1.png", "experiences/CoFounder_2.png", "experiences/CoFounder_3.png", "experiences/CoFounder_4.png", "projects/Kyronus_1.png", "projects/Kyronus_2.png", "projects/Kyronus_3.png", "projects/Kyronus_4.png", "projects/Kyronus_5.png"]
    }
  }, {
    "title": "Network Research Assistant",
    "by": "National Chiao Tung University",
    "period": ["09/01/2020", "01/01/2021"],
    "icon": "NCTU.png", 
    "type": "Network Engineering",
    "content": {
      "description": "<p><span><strong>Mobile/Multi-access edge computing (MEC)</strong> is one key technology to achieve low-latency performance in cellular networks. It has been determined as a key feature in future 5G networks by both ETSI and 3GPP standardization organizations. It seeks to provide a cloud computing platform at the network edge to be closer to mobile users than conventional cloud systems. Due to emerging low-latency demands, several MEC deployment solutions are being in development. We seek to design a MEC platform that can be easily deployed in 4G LTE networks, as well as may be used as a reference design for future 5G networks.</span></p><p><span>In this experience, I focused on <strong>the integration between Kubernetes and MEC platform</strong>, allowing end-users to define their custom domain name for a specific DNS provider. To be more specific, I first <span>I containerized the MEC kernel module (involving GPRS Tunnelling Protocol module and forwarding module), making network administrator easier to deploy the MEC kernel as either a Docker container or Helm Chart to their environment. Secondly, I&nbsp;</span>established the experiment environment with three machines acting as LTE EPC (Evolved Packet Core), UE(User Equipment), and MEC in 4G LTE, which involves NextEPC installation and configuration, packet routing using iptables and arp, and microk8s installation and configuration. On top of that, I packaged layer-4 and layer-7 load balancing to the MEC platform with External-DNS, enabling end-users to use annotation declaration to configure external DNS servers (AWS Route53, Google CloudDNS, and others) for Kubernetes Ingresses and Services. Finally, I experimented with many features provided by the Rancher, the open-source multi-cluster orchestration platform, including continuous integration and delivery, health and readiness probe, basic operation and configuration on a service and ingress in the Kubernetes.</span></p><p><span>What I have learned from this experience:</span></p><ol><li><span>The concept of cluster Architecture and object in Kubernetes.</span></li><li>The concept of layer-4 and Layer-7 load balancing.</li><li><span>Kubernetes object management through Kubectl and yaml file.</span></li><li>Packet routing through iptables rule installment and arp command.</li><li>Creating a maintainable Helm Chart.</li></ol>",
      "contributions": ["Supported 23 DNS providers for end-users to customize domain name of services."],
      "awards/honors": ["Shortlisted in Electronics and Optics track of <b>FutureTech Breakthrough Award</b> in FUTEX exhibition 2020 by Ministry of Science and Technology"],
      "images": ["experiences/NERA_1.png","projects/MEC_1.png", "projects/MEC_2.png", "projects/MEC_3.png"]
    }
  }, {
    "title": "Software Engineering Research Assistant",
    "by": "National Cheng Kung University",
    "period": ["11/01/2018", "06/01/2020"],
    "icon": "NCKU.png",
    "type": "Software Engineering",
    "content": {
      "description": "<p>Online judges are systems designed for the reliable evaluation of algorithm source code submitted by users, which is next compiled and tested in a homogeneous environment. Online judges are becoming popular in various applications, and is involved in the following functions for development:</p><ol><li><strong>Online compilers</strong>: systems that support only a compilation of source codes performed during a submission phase of the evaluation procedure.</li><li><strong>Data mining, education and competitive programming</strong>: systems that, by inferring from our functionality-oriented analysis, focus on (a) evaluation of solutions submitted for data mining problems are classified in a data mining category; (b) educational processes are considered as educational software; (c) implementation of ICPC or IOI scoring rules and archiving problems from past challenges are classified as competitive programming software.</li><li><strong>Recruitment platforms</strong>: online platforms targeted to employers to facilitate the recruitment of software developers for various IT projects, and which allow the evaluation and ranking of submitted solutions according to specific objective functions.</li><li><strong>Development platforms</strong>: systems that are often provided as open-source projects or binary archives, allowing users to customize deployments and configurations of these systems in their infrastructure.</li></ol><br><p>In this experience, acted as a project leader, I lead the 6-person team to develop an online judge platform to evaluate 200+ students&#39; performance in Program Design (I) course 2020. The project mainly includes platform construction and evaluation security. For the platform construction, we adopted Vue.js as a frontend framework to build our website. Furthermore, we applied a state management pattern using Vuex, a centralized store for all the components in an application, which is with rules ensuring that the state can only be mutated in a predictable fashion. Finally, we developed a content management system (CMS) with CRUD Web APIs for coding problem management. As for evaluation security, we sandboxed the process with the Linux system call filtering, namespace isolation, and discretionary access control to prevent users from escalating their privilege and accessing unauthorized resources. We also restricted the memory usage for each evaluation process and scaled the number of the service when under high traffic.</p><p>What I have learned from this experience:</p><ol><li>The practice of web platform construction using modern front-end framework.</li><li>The practice of CRUD API server using Node.js, in-memory data store, and NoSQL.</li><li>The concept of modern Linux containers (Linux kernel mechanism).</li><li>The leadership to lead a small group of people and manage the project&rsquo;s progress.</li></ol>",
      "contributions": ["Developed content management system (CMS) with Web APIs and Vue.js for coding problem management.", "Established a secure online automated judging process for programming problems"],
      "awards/honors": ["Won College Student Research Scholarship $1,800 USD (approx.) from National Science Council.", "Shortlisted in Digital Innovative Learning and Information Software Application Track of Taiwan Academic Network Conference 2020."],
      "images": ["projects/OJ_1.png", "projects/OJ_2.png", "projects/OJ_3.png", "projects/OJ_4.png"]
    }
  }, {
    "title": "Web Development Internship",
    "by": "FarEasTone Telecom",
    "period": ["07/01/2019", "09/01/2019"],
    "icon": "FarEasTone.png",
    "type": "Software Engineering",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "Teaching Assistant",
    "by": "National Cheng Kung University",
    "period": ["02/01/2019", "07/01/2019"],
    "icon": "NCKU.png",
    "type": "Software Engineering",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }],
  "Activity": [{
    "title": "Trainee",
    "by": "Advanced Information Security Summer School 2020",
    "period": ["07/27/2020", "08/02/2020"],
    "icon": "MOE.png",
    "type": "Learning",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "Trainee",
    "by": "Qiskit Global Summer School 2020",
    "period": ["07/20/2020", "08/07/2020"],
    "icon": "IBM.png",
    "type": "Learning",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "Volunteer",
    "by": "GDG Devfest Taipei 2019",
    "period": ["11/01/2019", "12/01/2019"],
    "icon": "GDGTaipei.png",
    "type": "Volunteer",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "Chief of IT Department",
    "by": "NCKU Bike Festival 2019",
    "period": ["11/01/2018", "03/01/2019"],
    "icon": "NCKU.png",
    "type": "Leadership",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "IT Specialist",
    "by": "NCKU Student Union 2018",
    "period": ["07/01/2017", "07/01/2018"],
    "icon": "NCKUSU.png",
    "type": "Volunteer",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }, {
    "title": "Leader of Education Team",
    "by": "NCKU CSIE Summer Camp 2018",
    "period": ["02/01/2018", "08/01/2018"],
    "icon": "NCKUCSIESummerCamp.png",
    "type": "Leadership",
    "content": {
      "description": "",
      "contributions": [],
      "awards/honors": [],
      "images": []
    }
  }]
}